Repository: GlitchMage1/SayTexty-AI-Accessibility
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: Speech to Text Assistant
ru: Ассистент преобразования речи в текст
uz: Nutqni matnga aylantirish assistenti

source: AI Accessibility Project
ru: Проект доступности с AI
uz: AI orqali imkoniyatlar loyihasi

source: Turn speech into clear text — for lectures, lessons and conversations.
ru: Преобразуйте речь в понятный текст — для лекций, уроков и разговоров.
uz: Nutqni aniq matnga aylantiring — ma’ruzalar, darslar va suhbatlar uchun.

source: Ready when you are
ru: Готов, когда вы готовы
uz: Siz tayyor bo‘lsangiz — biz ham tayyormiz

source: Start a
ru: Начать
uz: Boshlang

source: clean recording
ru: чистую запись
uz: yangi yozuvni

source: in one click.
ru: в один клик.
uz: bir bosishda.

source: Pick a mode, choose the language, and HearMe will transcribe everything for you.
ru: Выберите режим и язык — HearMe всё аккуратно расшифрует за вас.
uz: Rejimni va tilni tanlang — HearMe hamma narsani siz uchun matnga aylantiradi.

source: Session mode
ru: Режим сессии
uz: Sessiya rejimi

source: Long-form
ru: Длинный формат
uz: Uzun shakl

source: Lecture mode
ru: Режим лекции
uz: Ma’ruza rejimi

source: For classes & presentations
ru: Для уроков и презентаций
uz: Darslar va taqdimotlar uchun

source: Optimized for long lessons, talks and speeches.
ru: Оптимизирован для длительных уроков, выступлений и лекций.
uz: Uzun darslar, chiqishlar va ma’ruzalar uchun optimallashtirilgan.

source: Conversations
ru: Разговоры
uz: Suhbatlar

source: Conversation mode
ru: Режим беседы
uz: Suhbat rejimi

source: For dialogues & meetings
ru: Для диалогов и встреч
uz: Dialoglar va uchrashuvlar uchun

source: Short dynamic chunks for discussions and Q&A.
ru: Короткие динамичные фрагменты для обсуждений и вопросов-ответов.
uz: Munozaralar va savol-javoblar uchun qisqa, dinamik bo‘limlar.

source: Speech language
ru: Язык речи
uz: Nutq tili

source: English
ru: Английский
uz: Ingliz

source: Russian
ru: Русский
uz: Rus

source: Uzbek
ru: Узбекский
uz: O‘zbek

source: This is the language people will speak in this session.
ru: Язык, на котором будут говорить в этой сессии.
uz: Bu sessiyada ishlatiladigan nutq tili.

source: Start recording
ru: Начать запись
uz: Yozishni boshlash

source: Recent sessions
ru: Недавние сессии
uz: Oxirgi sessiyalar

source: Library
ru: Библиотека
uz: Kutubxona

source: Untitled session
ru: Сессия без названия
uz: Nomsiz sessiya

source: You don't have any sessions yet.
ru: У вас пока нет сессий.
uz: Hozircha sessiyangiz yo‘q.

source: built for accessibility
ru: создано для доступности
uz: hamma uchun yaratilgan

source: Simple, friendly and clear — made for everyone.
ru: Просто, понятно и дружелюбно — создано для всех.
uz: Sodda, qulay va tushunarli — har bir kishi uchun.

source: Pro mode activated
ru: Pro режим активирован
uz: Pro rejimi faollashtirildi

source: Advanced transcription console
ru: Расширенная консоль транскрипции
uz: Kengaytirilgan transkripsiya konsoli

source: Fine-tuned controls, richer feedback and a darker interface for deep work sessions.
ru: Тонкие настройки, больше обратной связи и тёмный интерфейс для глубокого фокуса.
uz: Aniq sozlamalar, to‘liqroq fikr-mulohaza va chuqur ish uchun qoramtir interfeys.

source: AI engine
ru: AI-движок

source: Online
ru: Онлайн

source: Latency
ru: Задержка

source: Stability
ru: Стабильность

source: Session profile
ru: Профиль сессии
uz: Sessiya profili

source: Recommended
ru: Рекомендовано
uz: Tavsiya etiladi

source: Lecture mode +
ru: Режим лекции +
uz: Ma’ruza rejimi +

source: Continuous capture with smarter segmentation and noise-resilient decoding for complex lectures.
ru: Непрерывная запись с умной сегментацией и устойчивым к шуму декодированием для сложных лекций.
uz: Murakkab ma’ruzalar uchun aqlli segmentatsiya va shovqinga chidamli dekodlash bilan uzluksiz yozuv.

source: Dialogues
ru: Диалоги
uz: Dialoglar

source: Dynamic
ru: Динамика
uz: Dinamik

source: Conversation mode +
ru: Режим беседы +
uz: Suhbat rejimi +

source: Segmented interaction tuned for fast Q&A, consultations and overlapping speakers.
ru: Сегментированное распознавание для быстрых Q&A, консультаций и ситуаций с одновременной речью.
uz: Tezkor Q&A, konsultatsiyalar va bir-biriga ustma-ust tushadigan nutqlar uchun segmentlangan ishlov.

source: Launch advanced session
ru: Запустить расширенную сессию
uz: Kengaytirilgan sessiyani ishga tushirish

source: Pro mode keeps the interface dark and focused while using the same safe engine under the hood.
ru: Pro режим сохраняет тёмный, сфокусированный интерфейс, используя тот же безопасный движок.
uz: Pro rejimi qoramtir, diqqatni jamlovchi interfeysni saqlaydi va xavfsiz AI mexanizmidan foydalanadi.

source: Signal overview
ru: Обзор сигнала
uz: Signal ko‘rinishi

source: Live
ru: В реальном времени

source: Last sessions
ru: Последние сессии
uz: Oxirgi sessiyalar

source: Untitled
ru: Без названия
uz: Nomsiz

source: No sessions yet.
ru: Пока нет сессий.
uz: Sessiyalar mavjud emas.
